# WidthParameterWarning Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarCouplerFailures..::..WidthParameterWarning Property
BuiltInFailures..::..RebarCouplerFailures Class See Also
---
This is used to post warning. The "External Diameter" parameter must be set to a strictly positive value.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId WidthParameterWarning { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WidthParameterWarning As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ WidthParameterWarning {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarCouplerFailures Class
Autodesk.Revit.DB Namespace